#include<iostream>
using namespace std;
int main() {
	//我写的这个是按照意识流写出来的看着不是很简便但肯定好理解，我会详细写注释
	int n, i, j;
	cin >> n;
	int a[n][n];
	for (i = 0; i < n; i++) { //输入矩阵
		for (j = 0; j < n; j++) {
			cin >> a[i][j];
		}
	}
	cout << a[0][0] << " ";//先把第一个元素输出，因为后面的我都是先走一步再输出，不第一个先输出就没空输出它了 
	i = 0;
	j = 0;
	//要意识到前一半和后一半矩阵的输出顺序是不一样的，前一半是右-左下-下-右上的循环，而后一半是右上-下-左下-右的循环，具体从哪个方向开始循环一会用goto语句解决
	//循环控制条件：首先i和jk肯定都得满足在0和n-1之间（也就是>0和<n），其次(i+j)!=2*n-2是用来控制输出结束的，也就是i=j=n-1的情况，为了方便在所有需要判定的地方都加上了，省着还得分析在哪加。
	while (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) { //这个while循环管的是前一半矩阵的输出
		if (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) { //右，因为只输出一个用if
			j++;
			cout << a[i][j] << " ";
		}

		while (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) { //左下，因为要在这个路径上循环输出多个，所以用while
			i++;
			j--;
			if (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) {
				cout << a[i][j] << " ";
			}
		}
		i--; //因为要while停止的话肯定是多走了一次越界了才停止循环，所以要往回退一个
		j++;
		if (i == n - 1) {  //前一半矩阵输出结束有两种情况，第一种是停在左下角，第二种是停在右上角。这是左下角的情况，接下来在后一半矩阵要先往右走，通过goto语句到第二个while循环中开始往右走。
			goto label1;
		}

		if (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) { //下
			i++;
			cout << a[i][j] << " ";
		}

		while (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) {  //右上
			i--;
			j++;
			if (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) {
				cout << a[i][j] << " ";
			}
		}
		i++;
		j--;
		if (j == n - 1) { //这是前一半矩阵在右上角结束的情况，接下来在后一半矩阵要先往下走，通过goto语句到第二个while循环中开始往下走。
			goto label2;
		}
	}
	while (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) { //这个while循环管的是后一半矩阵的输出，和第一个while循环中的四个部分本质一样，就是顺序不一样。
	label1:  //右（从第一个while循环跳转过来开始）
		if (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) {
			j++;
			cout << a[i][j] << " ";
		}

		while (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) { //右上
			i--;
			j++;
			if (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) {
				cout << a[i][j] << " ";
			}
		}
		i++;
		j--;

	label2: //下右（从第一个while循环跳转过来开始）
		if (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) {
			i++;
			cout << a[i][j] << " ";
		}

		while (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) { //左下
			i++;
			j--;
			if (i >= 0 && i < n && j >= 0 && j < n && (i + j) != 2 * n - 2) {
				cout << a[i][j] << " ";
			}
		}
		i--;
		j++;
	}
	return 0;
}